БухЭксп/Catalogs/CW_УведомленияСайта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_УведомленияСайта</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Релиз</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разряд1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разряд2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разряд3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разряд4</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеHTML</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ПрочитанныеУведомления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ПрочитанныеУведомления</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Уведомление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_УведомленияСайта</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Catalogs/CW_УведомленияСайта/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Список.Параметры.УстановитьЗначениеПараметра("Пользователь", ПараметрыСеанса.ТекущийПользователь);   
	
	ОбработатьИзменениеРежимаОтображенияНаСервере();  
	
КонецПроцедуры


&НаКлиенте
Процедура ОтметитьВсеПрочитанным(Команда)
	
	ОтметитьВсеПрочитаннымНаСервере();

КонецПроцедуры

&НаСервере
Процедура ОтметитьВсеПрочитаннымНаСервере()     
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_УведомленияСайта.Ссылка КАК Ссылка,
	               |	ВЫБОР
	               |		КОГДА CW_ПрочитанныеУведомления.Уведомление ЕСТЬ NULL
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК Прочитано
	               |ИЗ
	               |	Справочник.CW_УведомленияСайта КАК CW_УведомленияСайта
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ПрочитанныеУведомления КАК CW_ПрочитанныеУведомления
	               |		ПО CW_УведомленияСайта.Ссылка = CW_ПрочитанныеУведомления.Уведомление
	               |			И (CW_ПрочитанныеУведомления.Пользователь = &Пользователь)
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА CW_ПрочитанныеУведомления.Уведомление ЕСТЬ NULL
	               |				ТОГДА ЛОЖЬ
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ = ЛОЖЬ
	               |	И CW_УведомленияСайта.ПометкаУдаления = ЛОЖЬ";  
	
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий()Цикл
		РегистрыСведений.CW_ПрочитанныеУведомления.ПрочитатьУведомление(Выборка.Ссылка);
	КонецЦикла;
	
КонецПроцедуры  

&НаКлиенте
Процедура ПоказатьВсе(Команда)
	
	РежимОтбораСписка = 1;
	ОбработатьИзменениеРежимаОтображенияНаСервере();   
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьНепрочитанные(Команда)   
	
	РежимОтбораСписка = 0;
	ОбработатьИзменениеРежимаОтображенияНаСервере();  
	
КонецПроцедуры  

&НаСервере
Процедура ОбработатьИзменениеРежимаОтображенияНаСервере()
	
	Элементы.ФормаПоказатьВсе.Пометка = (РежимОтбораСписка = 1);
	Элементы.ФормаПоказатьНепрочитанные.Пометка = (РежимОтбораСписка = 0);
	
	УстановитьОтборСпискаНаСервере();
	
КонецПроцедуры


&НаСервере
Процедура УстановитьОтборСпискаНаСервере()
	
	Список.Отбор.Элементы.Очистить();
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ИндексКартинки");
	ЭлементОтбора.Использование 	= (РежимОтбораСписка = 0);
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение 	= 0;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрзуитьУведомления(Команда)
	ВыполнитьЗагрузкуУведомлений();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗагрузкуУведомлений()
	
	РезультатВыполнения =  ВыполнитьЗагрузкуУведомленийНаСервереВФоне();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатЗагрузкиУведомлений", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры    

&НаСервере
Функция ВыполнитьЗагрузкуУведомленийНаСервереВФоне() Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Выполняется загрузка уведомлений с сайта...";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;   
	
	ПараметрыПроцедуры = Новый Структура;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("CW_УведомленияСайтаСервер.ЗагрузитьУведомления", ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультатЗагрузкиУведомлений(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		Элементы.Список.Обновить();
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		ТекстПредупреждения = "Не удалось получить данные с сайте. Попробуйте позже.";
		ПоказатьПредупреждение(,ТекстПредупреждения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Уведомления_Прочитано" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры
